In [1]:
from pydataset import data

initiated datasets repo at: /Users/racheldownen/.pydataset/

In [2]:
import pandas as pd
import numpy as np

In [3]:
np.random.seed(123)

students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas',
            'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

# randomly generate scores for each student for each subject
# note that all the values need to have the same length here
math_grades = np.random.randint(low=60, high=100, size=len(students))
english_grades = np.random.randint(low=60, high=100, size=len(students))
reading_grades = np.random.randint(low=60, high=100, size=len(students))

df = pd.DataFrame({'name': students,
                   'math': math_grades,
                   'english': english_grades,
                   'reading': reading_grades})

type(df)

pandas.core.frame.DataFrame

In [4]:
print(df)

       name  math  english  reading
0     Sally    62       85       80
1      Jane    88       79       67
2     Suzie    94       74       95
3     Billy    98       96       88
4       Ada    77       92       98
5      John    79       76       93
6    Thomas    82       64       81
7     Marie    93       63       90
8    Albert    92       62       87
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72

In [5]:
Team = ['LAC', 'LAL', 'UTA', 'PHX', 'GSW', 'POR', 'MEM', 'SAS', 'DAL', 'DEN', 'OKC', 'NOR', 'SAC', 'HOU', 'MIN']
W = [40, 35, 45, 41, 29, 32, 29, 28, 30, 37, 20, 25, 23, 15, 15]
L = [19, 23, 15, 16, 29, 24, 27, 28, 26, 20, 38, 32, 34, 43, 43]

In [6]:
nba_df = pd.DataFrame({'Team': Team, 'W': W, 'L':L})

In [7]:
nba_df.head()

  Team   W   L
0  LAC  40  19
1  LAL  35  23
2  UTA  45  15
3  PHX  41  16
4  GSW  29  29

In [8]:
type(nba_df)

pandas.core.frame.DataFrame

In [ ]:
lac = ['LAC', 40, 19]
lal = ['LAL', 35, 23]
uta = ['UTA', 45, 15]
phx = ['PHX', 41, 16]
gsw = ['GSW', 29, 29]
por = ['POR', 32, 24]
mem = ['MEM', 29, 27]
sas = ['SAS', 28, 28]
dal = ['DAL', 30, 26]
den = ['DEN', 37, 20]
okc = ['OKC', 20, 38]
nor = ['NOR', 25, 32]
sac = ['SAC', 23, 34]
hou = ['HOU', 15, 43]
minn = ['MIN',15, 43]

In [24]:
nba=[lac,lal,uta,phx,gsw,por,mem,sas,dal,den,okc,nor,sac,hou,minn]

NameError: name 'lac' is not defined

In [22]:
nba_df = pd.DataFrame([lac,lal,uta,phx,gsw,por,mem,sas,dal,den,okc,nor,sac,hou,minn]), columns + {'Team', 'W', 'L'}

NameError: name 'lac' is not defined

In [9]:
from pydataset import data
color_df = data('HairEyeColor')

In [10]:
color_df

     Hair    Eye     Sex  Freq
1   Black  Brown    Male    32
2   Brown  Brown    Male    53
3     Red  Brown    Male    10
4   Blond  Brown    Male     3
5   Black   Blue    Male    11
6   Brown   Blue    Male    50
7     Red   Blue    Male    10
8   Blond   Blue    Male    30
9   Black  Hazel    Male    10
10  Brown  Hazel    Male    25
11    Red  Hazel    Male     7
12  Blond  Hazel    Male     5
13  Black  Green    Male     3
14  Brown  Green    Male    15
15    Red  Green    Male     7
16  Blond  Green    Male     8
17  Black  Brown  Female    36
18  Brown  Brown  Female    66
19    Red  Brown  Female    16
20  Blond  Brown  Female     4
21  Black   Blue  Female     9
22  Brown   Blue  Female    34
23    Red   Blue  Female     7
24  Blond   Blue  Female    64
25  Black  Hazel  Female     5
26  Brown  Hazel  Female    29
27    Red  Hazel  Female     7
28  Blond  Hazel  Female     5
29  Black  Green  Female     2
30  Brown  Green  Female    14
31    Red  Green  Female     7
32  Blond  Green  Female     8

In [11]:
type(df)

pandas.core.frame.DataFrame

In [13]:
nba_df.head()

  Team   W   L
0  LAC  40  19
1  LAL  35  23
2  UTA  45  15
3  PHX  41  16
4  GSW  29  29

In [15]:
    nba_df.tail()

   Team   W   L
10  OKC  20  38
11  NOR  25  32
12  SAC  23  34
13  HOU  15  43
14  MIN  15  43

In [16]:
nba_df

   Team   W   L
0   LAC  40  19
1   LAL  35  23
2   UTA  45  15
3   PHX  41  16
4   GSW  29  29
5   POR  32  24
6   MEM  29  27
7   SAS  28  28
8   DAL  30  26
9   DEN  37  20
10  OKC  20  38
11  NOR  25  32
12  SAC  23  34
13  HOU  15  43
14  MIN  15  43

In [17]:
nba_df.sample()

   Team   W   L
14  MIN  15  43

In [26]:
nba_df.sample(5, random_state=123)

   Team   W   L
7   SAS  28  28
10  OKC  20  38
4   GSW  29  29
0   LAC  40  19
5   POR  32  24

In [28]:
nba_df.sample(frac=0.25, random_state=123)

   Team   W   L
7   SAS  28  28
10  OKC  20  38
4   GSW  29  29
0   LAC  40  19

In [29]:
nba_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Team    15 non-null     object
 1   W       15 non-null     int64
 2   L       15 non-null     int64
dtypes: int64(2), object(1)
memory usage: 488.0+ bytes

In [30]:
nba_df.describe()

               W          L
count  15.000000  15.000000
mean   29.600000  27.800000
std     9.069572   8.889802
min    15.000000  15.000000
25%    24.000000  21.500000
50%    29.000000  27.000000
75%    36.000000  33.000000
max    45.000000  43.000000

In [32]:
nba_df.dtypes

Team    object
W        int64
L        int64
dtype: object

In [33]:
nba_df.shape

(15, 3)

In [40]:
type(nba_df.shape)

tuple

In [41]:
nba_df.shape[0]

15

In [35]:
nba_df.columns

Index(['Team', 'W', 'L'], dtype='object')

In [36]:
nba_df.index

RangeIndex(start=0, stop=15, step=1)

In [46]:
nba_df.columns = [col.lower() for col in nba_df.columns]
nba_df

   team   w   l
0   LAC  40  19
1   LAL  35  23
2   UTA  45  15
3   PHX  41  16
4   GSW  29  29
5   POR  32  24
6   MEM  29  27
7   SAS  28  28
8   DAL  30  26
9   DEN  37  20
10  OKC  20  38
11  NOR  25  32
12  SAC  23  34
13  HOU  15  43
14  MIN  15  43

In [47]:
df.columns = [col.lower() for col in df.columns]

In [43]:
nba_df.columns = ['TEAM', 'W', 'L']
nba_df

   TEAM   W   L
0   LAC  40  19
1   LAL  35  23
2   UTA  45  15
3   PHX  41  16
4   GSW  29  29
5   POR  32  24
6   MEM  29  27
7   SAS  28  28
8   DAL  30  26
9   DEN  37  20
10  OKC  20  38
11  NOR  25  32
12  SAC  23  34
13  HOU  15  43
14  MIN  15  43

In [45]:
nba_df.columns = nba_df.str.lower()

AttributeError: 'DataFrame' object has no attribute 'str'

Subsetting Dataframes
There are a number of ways we can access certain subsets, i.e. either a restricted number of rows, columns, or both, of our dataframes.

Accessing Multiple Columns
We can see multiple columns in the dataframe by subsetting the dataframe with a list of strings. The following two code samples are functionally equivalent.

In [51]:
nba_df['team'].head(2)

0    LAC
1    LAL
Name: team, dtype: object

In [52]:
nba_df[['team','w']].head(2)

  team   w
0  LAC  40
1  LAL  35

In [59]:
nba_df_winners = nba_df[(nba_df.w > 30) & (nba_df.l < 20)]

In [56]:
nba_df_winners

  team   w   l
0  LAC  40  19
1  LAL  35  23
2  UTA  45  15
3  PHX  41  16
5  POR  32  24
9  DEN  37  20

In [60]:
nba_df_winners = nba_df[['w', 'l']]

In [61]:
nba_df_winners

     w   l
0   40  19
1   35  23
2   45  15
3   41  16
4   29  29
5   32  24
6   29  27
7   28  28
8   30  26
9   37  20
10  20  38
11  25  32
12  23  34
13  15  43
14  15  43

In [62]:
nba_df_winners = nba_df[(nba_df.w > 30) & (nba_df.l < 20)]

In [63]:
nba_df_winners

  team   w   l
0  LAC  40  19
2  UTA  45  15
3  PHX  41  16

In [64]:
nba_df[nba_df.w > 30].team

0    LAC
1    LAL
2    UTA
3    PHX
5    POR
9    DEN
Name: team, dtype: object

In [66]:
nba_df[nba_df.w > 30]['team']

0    LAC
1    LAL
2    UTA
3    PHX
5    POR
9    DEN
Name: team, dtype: object

In [67]:
nba_df[nba_df.w > 30][['team', 'l']]

  team   l
0  LAC  19
1  LAL  23
2  UTA  15
3  PHX  16
5  POR  24
9  DEN  20

In [68]:
nba_df.columns

Index(['team', 'w', 'l'], dtype='object')

In [75]:
#add
nba_df['l2'] = nba_df['l']
nba_df

   team   w   l  l2
0   LAC  40  19  19
1   LAL  35  23  23
2   UTA  45  15  15
3   PHX  41  16  16
4   GSW  29  29  29
5   POR  32  24  24
6   MEM  29  27  27
7   SAS  28  28  28
8   DAL  30  26  26
9   DEN  37  20  20
10  OKC  20  38  38
11  NOR  25  32  32
12  SAC  23  34  34
13  HOU  15  43  43
14  MIN  15  43  43

In [74]:
#drop
nba_df = nba_df.drop(columns=['l2'])
nba_df.head()

  team   w   l
0  LAC  40  19
1  LAL  35  23
2  UTA  45  15
3  PHX  41  16
4  GSW  29  29

In [76]:
nba_df.drop(columns=['l2'], inplace= True)
nba_df.head()

  team   w   l
0  LAC  40  19
1  LAL  35  23
2  UTA  45  15
3  PHX  41  16
4  GSW  29  29

In [81]:
#renam#
nba_df.columns = ['hjkhjk', 'hl', 'drft']
nba_df.columns

Index(['hjkhjk', 'hl', 'drft'], dtype='object')

In [82]:
nba_df.rename(columns ={'name': 'team'}, inplace=True)

In [83]:
nba_df.head(2)

  hjkhjk  hl  drft
0    LAC  40    19
1    LAL  35    23

In [ ]:
nba.df.sort_values(by= 'win_pct', ascending=False)

In [ ]:
nba_df_sorted

In [ ]:
nba_df.sort_values(by='win_pct', ascending=False).head(8).team